        Load Data from SQL and convert to Pandas DataFrame for Analysis

In [36]:
import mysql.connector

conn = mysql.connector.connect(
    host='localhost',
    user='root', # comes when installing mysql on your local computer
    password='your_password'
)

In [37]:
# create a cursor object

cursor = conn.cursor()

In [38]:
# show all databases

cursor.execute(
    'show databases;'
)

In [39]:
result = cursor.fetchall()
print(result)

[('information_schema',), ('my_personal_database',), ('mysql',), ('performance_schema',), ('sakila',), ('sys',), ('world',)]

In [40]:
# select a database

cursor.execute(
    'use my_personal_database'
)

In [41]:
# show tables

cursor.execute(
    'show tables'
)

In [42]:
result = cursor.fetchall()

In [43]:
print(result)

[('babies',), ('employee',), ('employeesales',), ('everything',), ('sales',), ('weight',)]

In [44]:
# select everything from babies

cursor.execute(
    'select * from babies'
)

In [45]:
result = cursor.fetchall()

In [46]:
print(result)

[('F', 'Olivia', 1), ('F', 'Emma', 2), ('F', 'Mia', 3), ('M', 'Noah', 1), ('M', 'Liam', 2), ('M', 'Mateo', 3), ('M', 'Noah', 1), ('F', 'Olivia', 1), ('F', 'Mia', 3), ('M', 'Mateo', 3)]

In [47]:
# run a query

cursor.execute(
    '''
    select * from babies
    where  gender = 'F'
    order by popularity;
    '''
)

In [48]:
result = cursor.fetchall()

In [49]:
print(result)

[('F', 'Olivia', 1), ('F', 'Olivia', 1), ('F', 'Emma', 2), ('F', 'Mia', 3), ('F', 'Mia', 3)]

In [50]:
import pandas as pd

In [53]:
# read sql query result 

df = pd.read_sql('''SELECT * FROM babies;''', conn)

In [54]:
print(df)

  gender    name  popularity
0      F  Olivia           1
1      F    Emma           2
2      F     Mia           3
3      M    Noah           1
4      M    Liam           2
5      M   Mateo           3
6      M    Noah           1
7      F  Olivia           1
8      F     Mia           3
9      M   Mateo           3

In [55]:
# save the results to a csv

df.to_csv('bab.csv')

In [56]:
# load the csv

df = pd.read_csv('bab.csv')

In [57]:
# see the 1st 5 elements

df.head()

   Unnamed: 0 gender    name  popularity
0           0      F  Olivia           1
1           1      F    Emma           2
2           2      F     Mia           3
3           3      M    Noah           1
4           4      M    Liam           2

In [58]:
# see the last 5 elements

df.tail()

   Unnamed: 0 gender    name  popularity
5           5      M   Mateo           3
6           6      M    Noah           1
7           7      F  Olivia           1
8           8      F     Mia           3
9           9      M   Mateo           3

In [59]:
# type of df

print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [ ]:
# continue analysis